Repository: ferryfer14/base_project
Catalog: lib/l10n/app_*.arb
Languages: id

# welcome
source: Welcome & Let’s Get Energized!
id: Selamat Datang! & Semangat Menjalani Hari Ya!

# info_username
source: Your vehicle license plate number.
id: Plat nomor kendaraan anda.

# btn_login
source: Login
id: Masuk

# forgot
source: Forgot Password?
id: Lupa Password?

# proceeding
source: By proceeding, I accept the Kilats
id: Dengan ini, Saya menerima

# term
source: Terms & Condition
id: Syarat & Ketentuan

# confirm_privacy
source: and confirm that I have read Kilats
id: dan saya telah membaca

# privacy
source: privacy policy.
id: kebijakan privasi Kilats.

source: Find
id: Cari

source: List
id: Daftar

source: History
id: Riwayat

source: Profile
id: Profil

# allow_permission
source: Allow Location Access
id: Berikan Akses Lokasi

# permission
source: Kilats works better with granted access location. By continuing, you’re agree to give permission to Kilats app.
id: Kilats bekerja lebih baik dengan memberikan akses lokasi. Dengan melanjutkan ini, Anda setuju untuk memberikan izin kepada aplikasi Kilats.

source: Allow & Continue
id: Izinkan & Lanjutkan

source: Book now
id: Pesan

# search_cabinet
source: Search station, location name...
id: Cari stasiun, nama lokasi...

source: Nearby Station
id: Stasiun Terdekat

# see_more
source: See more results
id: Lihat lebih banyak

source: Navigate
id: Arahkan

source: Scan
id: Pindai

source: All
id: Semua

source: Ongoing
id: Berlangsung

source: Done
id: Selesai

source: Canceled
id: Dibatalkan

source: Swapping
id: Menukar

source: Language
id: Bahasa

# detail_language
source: Switch between English or Indonesian
id: Beralih antara bahasa Inggris atau bahasa Indonesia

source: Privacy Policy
id: Kebijakan Privasi

# read_privacy
source: Read our policy statement
id: Baca kebijakan dari kami

source: Logout
id: Keluar

# detail_logout
source: Exit from your account
id: Keluar dari akun anda

# copyright
source: © 2023 Kilats. All rights reserved. App version {version}
id: Â© 2023 Kilats. All rights reserved. App version {version}

# processing
source: Processing, please wait...
id: Sedang memproses, mohon tunggu...

# swap_done
source: Your swap is done
id: Proses penukaran anda telah selesai

# detail_swap_done
source: See details to see the instruction or back to menu to proceed later.
id: Lihat rincian untuk melihat instruksi atau kembali ke menu untuk melanjutkan nanti.

# go_main_screen
source: Go to Main Screen
id: Menuju Layar Utama

# view_detail
source: View Details
id: Lihat Rincian

source: Close
id: Tutup

source: Verified
id: Telah diverifikasi

source: Booked
id: Telah dipesan

source: Canceled at
id: Dibatalkan pada

source: Verified at
id: Diverifikasi pada

source: Booked at
id: Dipesan pada

source: Swapped at
id: Ditukar pada

# booking_detail
source: Booking Details
id: Rincian Booking

# step1
source: Go to the station, head to the cabinet you’ve booked
id: Pergi ke stasiun, menuju ke lemari yang telah Anda pesan

# step2
source: Verify booking by scan the code displayed on cabinet screen
id: Verifikasi pemesanan dengan memindai kode yang ditampilkan di layar kabinet

# step3
source: An empty slot door will be opened. Put your empty battery in the empty slot and close the door.
id: Pintu slot kosong akan terbuka. Letakkan baterai kosong Anda di slot kosong dan tutup pintunya.

# step4
source: Your chosen slot will be open. Pick your new battery and wait for the verification to finish the process.
id: Slot yang Anda pilih akan terbuka. Pilih baterai baru Anda dan tunggu hingga verifikasi selesai.

# slot_pick
source: Slot to Pick
id: Slot yang dipilih

# available_percentage
source: Available (%)
id: Tersedia (%)

# cabinet_detail
source: Cabinet Details
id: Rincian Kabinet

source: Cabinet ID
id: ID Kabinet

# total_slot
source: Total Slots
id: Total Slot

source: Battery Type
id: Tipe Baterai

# station_detail
source: Station Details
id: Rincian Stasiun

source: Station Name
id: Nama Stasiun

source: Address
id: Alamat

# username_cant_empty
source: Username can't be empty
id: Username tidak bisa kosong

source: Username not valid
id: Username tidak valid

# password_cant_empty
source: Password can't be empty
id: Password tidak bisa kosong

source: Password not valid
id: Password tidak valid

# username_or_password_wrong
source: Username or Password is wrong
id: Username atau Password salah

# refresh_data
source: Refreshing data. Please wait...
id: Sedang memuat data. Mohon tunggu...

# choose_battery
source: Choose the battery
id: Pilih baterai

# pick_available_slots
source: Pick by these available slots at the station.
id: Pilih berdasarkan slot yang tersedia pada stasiun ini.

source: Available
id: Tersedia

source: Your pick
id: Pilihan anda

source: Unavailable
id: Tidak Tersedia

source: Charging
id: Mengisi Daya

source: Empty
id: Kosong

source: Confirm Booking
id: Konfirmasi Pesanan

source: Back
id: Kembali

# success_booking
source: You’ve successfully made your booking!
id: Anda telah berhasil melakukan pemesanan!

# see_details_proceed
source: See details to see the instruction or back to menu to proceed later.
id: Lihat rincian untuk melihat instruksi atau kembali ke menu untuk melanjutkan nanti.

source: Back to menu
id: Kembali ke menu

source: See Details
id: Lihat Rincian

# station_empty
source: No station available
id: Tidak ada stasiun yang tersedia

# no_station
source: We’re sorry there is no station nearby this area.
id: Maaf, tidak ada stasiun di dekat area ini.

# session_end
source: Your session ended.
id: Sesi anda telah berakhir.

# transaction_empty
source: No history available
id: Tidak ada riwayat yang tersedia

# transaction_detail_empty
source: There is no battery exchange transaction.
id: Tidak ada transaksi penukaran baterai.

source: Back To Detail
id: Kembali ke Rincian

source: Cancel Booking
id: Pesanan Dibatalkan

# cancel_pop_title
source: Cancel this booking
id: Batalkan pemesanan ini

# cancel_pop_detail
source: Are you sure want to cancel this booking?
id: Anda yakin ingin membatalkan pemesanan ini?

source: Try Again
id: Coba Lagi

# open_setting
source: Open Settings
id: Buka Pengaturan

# title_lost_connection
source: Oops, looks like you lost your internet connection
id: Oops, sepertinya koneksi internet anda terputus

# detail_lost_connection
source: Please make sure you device is connected to the network to continue.
id: Pastikan perangkat anda terhubung ke internet untuk melanjutkan.

# call_cs
source: Call 081-000-111
id: Hubungi 081-000-111

# tap_for_exit
source: Tap back again to leave
id: Ketuk kembali lagi untuk keluar

# reminder_title_30
source: 30 minutes remaining
id: 30 menit tersisa

# reminder_detail_30
source: You have 30 minutes left to swap the battery
id: Waktu anda tersisa 30 menit lagi untuk menukar baterai

# reminder_title_15
source: 15 minutes remaining for battery swap
id: 15 menit tersisa

# reminder_detail_15
source: You have 15 minutes left to swap the battery
id: Waktu anda tersisa 15 menit lagi untuk menukar baterai

# please_select_slot
source: Please choose a slot
id: Mohon pilih slot terlebih dahulu

# title_new_version
source: A new version of our app is now available
id: Versi Pembaharuan telah tersedia

# detail_new_version
source: Update now to experience the latest features and improvements.
id: Perbarui sekarang untuk merasakan fitur dan peningkatan terbaru.

source: Later
id: Nanti

source: Update
id: Perbaharui

# invalid_code
source: The code is invalid. Please try again later
id: Code tidak valid. Silakan coba lagi nanti

source: Swap before
id: Tukar sebelum

source: Login to Kilats
id: Masuk ke Kilats

# intro_title1
source: Welcome to Kilats!
id: Selamat datang di Kilats!

# intro_title2
source: Find Batteries Across The City
id: Temukan Baterai di Seluruh Kota

# intro_title3
source: Swap with Ease Like Counting Up to Three
id: Tukar dengan Mudah Seperti Menghitung Sampai Tiga

# intro_title4
source: Ready for Another Adventure?
id: Siap untuk Petualangan Lain?

# intro_detail1
source: Anywhere you roam, hit the road with confidence as you’re always in a safe hands. Find batteries fast, and swap with ease.
id: Ke mana pun Anda pergi, pergilah dengan percaya diri karena Anda selalu berada di tangan yang aman. Temukan baterai dengan cepat, dan tukar dengan mudah.

# intro_detail2
source: Ride worry-free and find batteries nearby with Kilats station near your destination.
id: Berkendara tanpa khawatir dan temukan baterai di sekitar dengan stasiun Kilats di dekat tempat tujuan Anda.

# intro_detail3
source: Book, scan the barcode, and swap the battery. Then you’re ready for another miles full of juices.
id: Pesan, pindai barcode, dan tukar baterai. Kemudian Anda siap untuk menempuh jarak bermil-mil lagi.

# intro_detail4
source: Ride with pride. Enjoy your delightful electric experience.
id: Berkendara dengan bangga. Nikmati pengalaman berkendara dengan listrik yang menyenangkan.

source: Booking ID
id: ID Pemmesanan

source: Scan Success
id: Pemindaian Berhasil

# title_scan_success
source: Please swap the battery now
id: Silakan tukar baterai sekarang

# detail_scan_success
source: See details to see the instruction or back to menu to proceed later.
id: Lihat detail untuk melihat instruksi atau kembali ke menu untuk melanjutkan.

source: See instructions
id: Lihat petunjuk
